Revit 2027 API
ParameterTypeId.ViewScaleImperial Property
 "Scale:"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewScaleImperial { get; }
Public Shared ReadOnly Property ViewScaleImperial As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewScaleImperial {
	ForgeTypeId^ get ();
}
static member ViewScaleImperial : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace